#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Validation `success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

module.demo.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0ba9bf7f9ec6eb1c1]
module.demo.aws_s3_bucket.aws_s3_bucket: Refreshing state... [id=cq-glue-target-bucket]
module.demo.aws_glue_registry.aws_glue_registry: Refreshing state... [id=arn:aws:glue:us-east-1:707066037989:registry/cq-glue-registry]
module.demo.aws_kms_key.aws_kms_key: Refreshing state... [id=0847cfe4-b48d-4c3d-a82b-b67613e99306]
module.demo.aws_iam_role.crawler_role: Refreshing state... [id=cq-crawler-role]
module.demo.aws_glue_workflow.workflow: Refreshing state... [id=cq-workflow]
module.demo.aws_glue_classifier.aws_glue_classifier1: Refreshing state... [id=cq-glue-classifier]
module.demo.aws_glue_catalog_database.aws_glue_catalog_database: Refreshing state... [id=707066037989:cq-glue-database]
module.demo.data.aws_availability_zones.available: Reading...
module.demo.data.aws_iam_policy_document.aws_iam_policy_document: Reading...
module.demo.data.aws_iam_policy_document.aws_iam_policy_document: Read complete after 0s [id=3118019012]
module.demo.aws_iam_role.aws_iam_role: Refreshing state... [id=AWSGlueServiceRole-cq-role]
module.demo.data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.demo.aws_glue_user_defined_function.aws_glue_user_defined_function: Refreshing state... [id=707066037989:cq-glue-database:cq-glue-user-function]
module.demo.aws_glue_data_catalog_encryption_settings.example: Refreshing state... [id=707066037989]
module.demo.aws_glue_security_configuration.example: Refreshing state... [id=cq-glue-security-config]
module.demo.aws_glue_schema.aws_glue_schema: Refreshing state... [id=arn:aws:glue:us-east-1:707066037989:schema/cq-glue-registry/example]
module.demo.aws_glue_dev_endpoint.aws_glue_dev_endpoint: Refreshing state... [id=cq-dev-endpoint]
module.demo.aws_iam_role_policy_attachment.aws_iam_role_policy_attachment: Refreshing state... [id=AWSGlueServiceRole-cq-role-20220727095104529500000001]
module.demo.module.vpc.aws_egress_only_internet_gateway.this[0]: Refreshing state... [id=eigw-0e69619ac203bb48d]
module.demo.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0db61bc236adb89c0]
module.demo.module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0465a6b1f109a158f]
module.demo.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0aeb44ed9e99a03a3]
module.demo.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0e95b668a35517cc1]
module.demo.module.vpc.aws_route.private_ipv6_egress[0]: Refreshing state... [id=r-rtb-0db61bc236adb89c02750132062]
module.demo.module.vpc.aws_route.private_ipv6_egress[1]: Refreshing state... [id=r-rtb-0465a6b1f109a158f2750132062]
module.demo.aws_glue_connection.aws_glue_connection: Refreshing state... [id=707066037989:cq-glue-connection]
module.demo.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0a8051bfdf4a1b0f2]
module.demo.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-026defab046274662]
module.demo.aws_glue_catalog_table.aws_glue_catalog_table: Refreshing state... [id=707066037989:cq-glue-database:cq-glue-table]
module.demo.aws_glue_job.example: Refreshing state... [id=cq-glue-job]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.demo.module.vpc.aws_route_table.private[0] has changed
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0db61bc236adb89c0"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = "eigw-0e69619ac203bb48d"
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = "::/0"
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "cq-glue-private-us-east-1a"
        }
        # (5 unchanged attributes hidden)
    }

  # module.demo.module.vpc.aws_route_table.private[1] has changed
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0465a6b1f109a158f"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = "eigw-0e69619ac203bb48d"
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = "::/0"
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "cq-glue-private-us-east-1b"
        }
        # (5 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.demo.aws_glue_classifier.aws_glue_classifier1 will be destroyed
  # (because aws_glue_classifier.aws_glue_classifier1 is not in configuration)
  - resource "aws_glue_classifier" "aws_glue_classifier1" {
      - id   = "cq-glue-classifier" -> null
      - name = "cq-glue-classifier" -> null

      - csv_classifier {
          - allow_single_column    = false -> null
          - contains_header        = "PRESENT" -> null
          - delimiter              = "," -> null
          - disable_value_trimming = false -> null
          - header                 = [
              - "example1",
              - "example2",
            ] -> null
          - quote_symbol           = "'" -> null
        }
    }

  # module.demo.aws_glue_connection.aws_glue_connection will be updated in-place
  ~ resource "aws_glue_connection" "aws_glue_connection" {
      ~ connection_properties = (sensitive value)
        id                    = "707066037989:cq-glue-connection"
        name                  = "cq-glue-connection"
        tags                  = {}
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.demo.aws_glue_crawler.aws_glue_crawler will be created
  + resource "aws_glue_crawler" "aws_glue_crawler" {
      + arn           = (known after apply)
      + configuration = jsonencode(
            {
              + Grouping = {
                  + TableGroupingPolicy = "CombineCompatibleSchemas"
                }
              + Version  = 1
            }
        )
      + database_name = "cq-glue-database"
      + id            = (known after apply)
      + name          = "cq-crawler"
      + role          = "arn:aws:iam::707066037989:role/cq-crawler-role"
      + schedule      = "cron(0 1 * 1 *)"
      + tags_all      = (known after apply)

      + catalog_target {
          + database_name = "cq-glue-database"
          + tables        = [
              + "cq-glue-table",
            ]
        }

      + dynamodb_target {
          + path     = "table-name"
          + scan_all = true
        }

      + jdbc_target {
          + connection_name = "cq-glue-connection"
          + path            = "database-name/%"
        }

      + s3_target {
          + exclusions  = [
              + "year-**",
            ]
          + path        = "s3://cq-glue-target-bucket"
          + sample_size = 10
        }

      + schema_change_policy {
          + delete_behavior = "LOG"
          + update_behavior = "UPDATE_IN_DATABASE"
        }
    }

  # module.demo.aws_glue_ml_transform.aws_glue_ml_transform will be created
  + resource "aws_glue_ml_transform" "aws_glue_ml_transform" {
      + arn          = (known after apply)
      + glue_version = (known after apply)
      + id           = (known after apply)
      + label_count  = (known after apply)
      + max_capacity = (known after apply)
      + name         = "cq-glue-ml-transform"
      + role_arn     = "arn:aws:iam::707066037989:role/AWSGlueServiceRole-cq-role"
      + schema       = (known after apply)
      + tags_all     = (known after apply)
      + timeout      = 2880

      + input_record_tables {
          + database_name = "cq-glue-database"
          + table_name    = "cq-glue-table"
        }

      + parameters {
          + transform_type = "FIND_MATCHES"

          + find_matches_parameters {
              + primary_key_column_name = "my_column_1"
            }
        }
    }

  # module.demo.aws_glue_partition.aws_glue_partition will be created
  + resource "aws_glue_partition" "aws_glue_partition" {
      + catalog_id         = (known after apply)
      + creation_time      = (known after apply)
      + database_name      = "cq-glue-database"
      + id                 = (known after apply)
      + last_accessed_time = (known after apply)
      + last_analyzed_time = (known after apply)
      + partition_values   = [
          + "some-value",
        ]
      + table_name         = "cq-glue-table"
    }

  # module.demo.aws_glue_partition_index.aws_glue_partition_index will be created
  + resource "aws_glue_partition_index" "aws_glue_partition_index" {
      + catalog_id    = (known after apply)
      + database_name = "cq-glue-database"
      + id            = (known after apply)
      + table_name    = "cq-glue-table"

      + partition_index {
          + index_name   = "cq-glue-partitition"
          + index_status = (known after apply)
          + keys         = [
              + "my_column_1",
              + "my_column_2",
            ]
        }
    }

  # module.demo.aws_glue_trigger.example will be created
  + resource "aws_glue_trigger" "example" {
      + arn         = (known after apply)
      + description = "test trigger"
      + enabled     = true
      + id          = (known after apply)
      + name        = "cq-glue-trigger"
      + state       = (known after apply)
      + tags_all    = (known after apply)
      + type        = "ON_DEMAND"

      + actions {
          + job_name = "cq-glue-job"
        }
    }

Plan: 5 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.binary"

```

</details>

*Pusher: @irmatov, Action: `pull_request_target`, Working Directory: ``, Workflow: `terraform_plan`*